// Вывести на экран текст "лесенкой"
#include <stdio.h>

int main(void)
{
    printf("Let's\n\tgo\n\t\tto\n\t\t\twalk");
    return 0;
}
